app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "it sure is!"], ["message_id", 6], ["user_id", 2], ["created_at", "2017-07-25 04:22:08.863710"], ["updated_at", "2017-07-25 04:22:08.863710"]]
---
	def create

		@comment = @message.comments.create(comment_params)