app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY created_at DESC
---
  def index
  	@messages = Message.all.order('created_at DESC')

INSERT INTO "messages" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "go"], ["description", "go also"], ["created_at", "2017-07-25 02:16:01.109229"], ["updated_at", "2017-07-25 02:16:01.109229"]]
---
  def create
  	@message = current_user.messages.build(message_params)
  	  if @message.save

UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "I just want to get paid"], ["updated_at", "2017-07-25 03:09:05.795589"], ["id", 3]]
---
  def update
    if @message.update(message_params)

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 2]]
---
  def destroy
    @message.comments.clear